from django.apps import AppConfig


class PollsConfig(AppConfig):
    name = 'polls'

# файлф помеченные синими точками означают что там были незафиксированные изменения. то есть они не были нигде сохранены? да, щас покажу где именно. получается они все аки сохранены в гите? нет, папка с гитом содержит только зафиксированные изменения, которые необходимо синхронизировать с гитхабом. а синие точки свидетельствуют что есть изменения которые , ну скажем еще не записксированы, и находятся только в твоем проекте. компе? да, но и папка с гитом у тебя на компе, кроме того обязательно в корне твоего проекта. и она помечена как скрытая папка (первая точка свидетельсвует что файл скрыт, как в винде, только в линуксе просто точка ставится.) а вот тут не понял. всмысле скрыта от интернета и от внешнего доступа или типа того?  и что это было? ты просто скрываешь скрытые файлы/папки. не ужели на винже так не делал?) а зачем тогда их скрывать если есть ктрл+х , ну это скрытие подразумевает как правило что эти папки служебные и их лучше не трогать подобру по здорову. но ты их всегда можешь отобразить и посмотреть. и все) понял.

#ладно, в эту папку обычно не заглядывают, лучше почтитать на хабре статью что там находится. к делу.
